app/controllers/nasa_images_controller.rb

  def create
    begin
      @image_search = ImageSearch.new(image_search_params)

      if @image_search.valid?
        NasaImage.delete_all
        @image_retriever = ImageDataRetriever.new(@image_search, 1)
        @nasa_images = get_nasa_data(@image_retriever, 1)
        NasaImage.create!(@nasa_images)
---
DELETE FROM "nasa_images"
INSERT INTO "nasa_images" ("center", "date_image_created", "description", "keywords", "media_type", "nasa_id", "title", "image_collection_url", "thumbnail_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @page_count = 16
    @nasa_images = NasaImage.all.paginate(page: params[:page], per_page: @page_count)
---
SELECT COUNT(*) FROM "nasa_images"

  def show
    @nasa_image = NasaImage.find(params[:id])
---
SELECT  "nasa_images".* FROM "nasa_images" WHERE "nasa_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]